In [39]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import datetime as dt
import seaborn as sns

In [40]:
%cd "D:\ALAB study content\Python_classe_files\Case Studies\Python Foundation Case Study 2 - Credit Card Case Study (1)\Case Study 2 - Credit Card Case Study"

D:\ALAB study content\Python_classe_files\Case Studies\Python Foundation Case Study 2 - Credit Card Case Study (1)\Case Study 2 - Credit Card Case Study

In [142]:
# Importing the data in python environment to operate.

cust_acq= pd.read_csv('Customer Acqusition.csv')
repay_data= pd .read_csv('Repayment.csv')
spend_data= pd.read_csv('spend.csv')

In [96]:
cust_acq.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   No        100 non-null    int64
 1   Customer  100 non-null    object
 2   Age       100 non-null    int64
 3   City      100 non-null    object
 4   Product   100 non-null    object
 5   Limit     100 non-null    float64
 6   Company   100 non-null    object
 7   Segment   100 non-null    object
dtypes: float64(1), int64(2), object(5)
memory usage: 6.4+ KB

In [97]:
repay_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1500 entries, 0 to 1499
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   SL No:    1500 non-null   int64
 1   Customer  1500 non-null   object
 2   Month     1500 non-null   object
 3   Amount    1500 non-null   float64
dtypes: float64(1), int64(1), object(2)
memory usage: 47.0+ KB

In [98]:
spend_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1500 entries, 0 to 1499
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Sl No:    1500 non-null   int64
 1   Customer  1500 non-null   object
 2   Month     1500 non-null   object
 3   Type      1500 non-null   object
 4   Amount    1500 non-null   float64
dtypes: float64(1), int64(1), object(3)
memory usage: 58.7+ KB

In [144]:
# Merging the data through left join.

data_1= pd.merge(left= repay_data, right= cust_acq, left_on=['Customer'], right_on=['Customer'], how= 'left')

In [145]:
# Merging the data through left join that would be final data.

final_data = pd.merge(left= data_1, right= spend_data, left_on='Customer',right_on='Customer', how='left')

In [143]:
# Renaming the name so that data can join. 

cust_acq.rename(columns={'No':'sr_no'}, inplace= True)
repay_data.rename(columns= {'SL No:':'sr_no'},inplace= True)
spend_data.rename(columns= {'sl No':'sr_no'}, inplace= True)

In [146]:
final_data

,sr_no_x,Customer,Month_x,Amount_x,sr_no_y,Age,City,Product,Limit,Company,Segment,Sl No:,Month_y,Type,Amount_y
0,1,A1,12-Jan-04,495414.75,1,76,BANGALORE,Gold,500000.0,C1,Self Employed,1,12-Jan-04,JEWELLERY,485470.80
1,1,A1,12-Jan-04,495414.75,1,76,BANGALORE,Gold,500000.0,C1,Self Employed,2,03-Jan-04,PETRO,410556.13
2,1,A1,12-Jan-04,495414.75,1,76,BANGALORE,Gold,500000.0,C1,Self Employed,3,15-Jan-04,CLOTHES,23740.46
3,1,A1,12-Jan-04,495414.75,1,76,BANGALORE,Gold,500000.0,C1,Self Employed,4,25-Jan-04,FOOD,484342.47
4,1,A1,12-Jan-04,495414.75,1,76,BANGALORE,Gold,500000.0,C1,Self Employed,5,17-Jan-05,CAMERA,369694.07
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
37279,1498,A69,11-Jul-06,247628.45,69,33,CALCUTTA,Platimum,10000.0,C31,Self Employed,1498,31-Mar-06,BUS TICKET,50449.44
37280,1499,A70,12-Aug-05,454016.51,70,16,BOMBAY,Platimum,10001.0,C32,Self Employed,72,23-Feb-05,AIR TICKET,188959.72
37281,1499,A70,12-Aug-05,454016.51,70,16,BOMBAY,Platimum,10001.0,C32,Self Employed,1499,23-Mar-06,BUS TICKET,80593.94
37282,1500,A71,13-Sep-04,56286.33,71,34,BOMBAY,Platimum,10002.0,C33,Self Employed,73,01-Feb-05,AIR TICKET,116422.06
37283,1500,A71,13-Sep-04,56286.33,71,34,BOMBAY,Platimum,10002.0,C33,Self Employed,1500,24-Mar-06,BUS TICKET,194447.62

# 1. In the above dataset,

# a. In case age is less than 18, replace it with mean of age values.

In [147]:
# finding the mean of Age and applying condition on <18.

age_mean= final_data['Age'].mean()  

final_data['Age'] =final_data['Age'].apply(lambda x: age_mean if x<18 else x)

In [28]:
#for i in final_data['Age']:
#    if i <18:
#        print(final_data['Age'].mean())
 #   else:
#        print(i)
#print(final_data.Age)

# b. In case spend amount is more than the limit, replace it with 50% of that customer’s limit. (customer’s limit provided in acquisition table is the per transaction limit on his card)

In [148]:
final_data.rename(columns={'Month_x':'Repay_mon', 'Amount_x':'Repay_amt', 'Month_y':'Spend_mon','Amount_y':'Spend_amt' },inplace= True)

In [165]:
final_data.head(1)

,sr_no_x,Customer,Repay_mon,Repay_amt,sr_no_y,Age,City,Product,Limit,Company,Segment,Sl No:,Spend_mon,Type,Spend_amt
0,1,A1,12-Jan-04,495414.75,1,76.0,BANGALORE,Gold,500000.0,C1,Self Employed,1,12-Jan-04,JEWELLERY,250000.0

In [163]:
#final_data.apply(lambda x :0.5*x['Limit'] if x['Spend_amt']> x['Limit'] else x['Spend_amt'],axis=1 )

In [166]:
final_data['half_limt']= 0.5*final_data.groupby('Customer')[['Limit']].transform('first')
final_data['Spend_amt']=final_data[['Spend_amt','half_limt']].min(axis= 1)
final_data['Spend_amt']

0        250000.00
1        250000.00
2         23740.46
3        250000.00
4        250000.00
           ...
37279      5000.00
37280      5000.50
37281      5000.50
37282      5001.00
37283      5001.00
Name: Spend_amt, Length: 37284, dtype: float64

In [164]:
final_data = final_data.drop(columns= 'half_limt')
final_data.head(2)

,sr_no_x,Customer,Repay_mon,Repay_amt,sr_no_y,Age,City,Product,Limit,Company,Segment,Sl No:,Spend_mon,Type,Spend_amt
0,1,A1,12-Jan-04,495414.75,1,76.0,BANGALORE,Gold,500000.0,C1,Self Employed,1,12-Jan-04,JEWELLERY,250000.0
1,1,A1,12-Jan-04,495414.75,1,76.0,BANGALORE,Gold,500000.0,C1,Self Employed,2,03-Jan-04,PETRO,250000.0

# c. Incase the repayment amount is more than the limit, replace the repayment with the limit.

In [167]:
final_data['Repay_amt']= final_data[['Repay_amt', 'Limit']].min(axis=1)

In [172]:
final_data[['Repay_amt','Limit']].min(axis=1)

0        495414.75
1        495414.75
2        495414.75
3        495414.75
4        495414.75
           ...
37279     10000.00
37280     10001.00
37281     10001.00
37282     10002.00
37283     10002.00
Length: 37284, dtype: float64

# 2. From the above dataset create the following summaries:

# a. How many distinct customers exist?

In [ ]:
final_data['Customer'].nunique()

# b. How many distinct categories exist?

In [ ]:
final_data['Type'].nunique()

# c. What is the average monthly spend by customers?

In [ ]:
final_data.groupby('Customer')[['Spend_amt']].mean()

# d. What is the average monthly repayment by customers?

In [ ]:
final_data.groupby(['Customer', 'Months'])[['Repay_amt']].mean()

# f. What are the top 5 product types?

In [ ]:
amt_of_product= final_data.groupby('Type')['Spend_amt'].sum()
amt_of_product.sort_values(ascending= False)

# g. Which city is having maximum spend?

In [ ]:
final_data.groupby('City')['Spend_amt'].sum()
final_data.groupby('City')['Spend_amt'].sum().sort_values(ascending= False)

# h. Which age group is spending more money?

In [ ]:
age_group= final_data.groupby('Age')['Spend_amt'].sum()
age_group.idxmax()

# i. Who are the top 10 customers in terms of repayment?

In [ ]:
final_data.groupby('Customer')['Repay_amt'].sum()

final_data.groupby('Customer')['Repay_amt'].sum().sort_values(ascending= False).head(10)

# 3. Calculate the city wise spend on each product on yearly basis. Also include a graphical representation for the same.

In [ ]:
final_data['Date'] = pd.to_datetime(final_data['Spend_mon'])
final_data['Years'] = final_data['Date'].dt.year
city_wise= final_data.groupby(['City','Product','Years'])['Spend_amt'].sum()

In [ ]:
plt.hist(x= city_wise, bins = 6 )

# 4. Create graphs for

# a. Monthly comparison of total spends, city wise

In [ ]:
final_data['Dated']= pd.to_datetime(final_data['Spend_mon'])
final_data['Months']= final_data['Dated'].dt.month
mon_compare= final_data.groupby(['City','Months','Years'])['Spend_amt'].sum()
#sns.barplot(x = mon_compare.index, y =mon_compare.values, palette="viridis")
plt.scatter(x = final_data['Months'], y=final_data['Months'])

# b. Comparison of yearly spend on air tickets

In [ ]:
final_data[['Spend_amt', 'Years']]
air_tkt= final_data[(final_data['Type']== 'AIR TICKET')]
yearly_spend= air_tkt.groupby('Years')['Spend_amt'].sum()
sns.barplot(x=yearly_spend.index, y=yearly_spend.values, palette="viridis")
plt.title('Yearly Spend on Air Tickets')

# c. Comparison of monthly spend for each product (look for any seasonality that exists in terms of spend).

In [ ]:
final_data.groupby(['Type', 'Months'])['Spend_amt'].sum()